dadamachines/ArduinoCore-samd/variants/composer-pro/variant.h
#define S_PA00     ( 0+64)
#define S_PA01     ( 1+64)
#define S_PA02     ( 2+64)      // DAC OUT
#define S_PA03     ( 3+64)      // AREF
#define S_PA04     ( 4+64)      // BUS_I2C_1_SDA
#define S_PA05     ( 5+64)      // BUS_I2C_1_SCL
#define S_PA06     ( 6+64)      // PA06_TOUCH     X2
#define S_PA07     ( 7+64)      // PA07_TOUCH     X1
#define S_PA08     ( 8+64)      // SYNC_IN_1
#define S_PA09     ( 9+64)      // SYNC_IN_2
#define S_PA10     (10+64)      // PA10_TOUCH     X0
#define S_PA11     (11+64)      // PA11_TOUCH     Y13
#define S_PA12     (12+64)      // MIDI_O RX
#define S_PA13     (13+64)      // MIDI_O TX
#define S_PA14     (14+64)
#define S_PA15     (15+64)      // OLED DISPLAY D/C
#define S_PA16     (16+64)      // SPI_OLED MOSI
#define S_PA17     (17+64)      // SPI_OLED SCK
#define S_PA18     (18+64)      // SPI_OLED CS
#define S_PA19     (19+64)      // SPI_OLED MISO
#define S_PA20     (20+64)      // PA20_TOUCH     Y8
#define S_PA21     (21+64)      // PA21_TOUCH     Y7
#define S_PA22     (22+64)      // I2C_2_SDA 
#define S_PA23     (23+64)      // I2C_2_SCL 
#define S_PA24     (24+64)      // USB_D_N
#define S_PA25     (25+64)      // USB_D_P
#define S_PA26     (26+64)
#define S_PA27     (27+64)
#define S_PA28     (28+64)
#define S_PA29     (29+64)
#define S_PA30     (30+64)      // SWCLK
#define S_PA31     (31+64)      // SWDIO

#define S_PB00     ( 0+96)      // PB00_TOUCH     Y6
#define S_PB01     ( 1+96)      // PB01_TOUCH     Y5
#define S_PB02     ( 2+96)      // MIDI_1_TX
#define S_PB03     ( 3+96)      // MIDI_1_RX
#define S_PB04     ( 4+96)      // PB04_TOUCH     Y4
#define S_PB05     ( 5+96)      // PB05_TOUCH     Y3
#define S_PB06     ( 6+96)      // PB06_TOUCH     Y2
#define S_PB07     ( 7+96)      // PB07_TOUCH     Y1
#define S_PB08     ( 8+96)      // PB08_TOUCH     Y0
#define S_PB09     ( 9+96)      // TCA9555 TOUCHStrip LEDs INT Pin --> NOT NEEDED
#define S_PB10     (10+96)
#define S_PB11     (11+96)
#define S_PB12     (12+96)      // PB12_TOUCH     Y12
#define S_PB13     (13+96)      // PB13_TOUCH     Y11
#define S_PB14     (14+96)      // PB14_TOUCH     Y10
#define S_PB15     (15+96)      // PB15_TOUCH     Y9
#define S_PB16     (16+96)      // OLED_RESET
#define S_PB17     (17+96)      // BUILTIN LED
#define S_PB18     (18+96)
#define S_PB19     (19+96)
#define S_PB20     (20+96)
#define S_PB21     (21+96)
#define S_PB22     (22+96)      // SYNC_OUT_1
#define S_PB23     (23+96)      // SYNC_OUT_2
#define S_PB24     (24+96)
#define S_PB25     (25+96)
#define S_PB26     (26+96)
#define S_PB27     (27+96)
#define S_PB28     (28+96)
#define S_PB29     (29+96)
#define S_PB30     (30+96)      // SWO
#define S_PB31     (31+96)


/////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////


// ONLY AVAILABLE ON MASTER ///////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////

// QSPI Pins
#define PIN_QSPI_SCK    M_PB10    // FLASH_SD QSPI_SCK
#define PIN_QSPI_CS     M_PB11    // FLASH_SD QSPI_CS
#define PIN_QSPI_IO0    M_PA08    // FLASH_SD QSPI_D0 
#define PIN_QSPI_IO1    M_PA09    // FLASH_SD QSPI_D1 
#define PIN_QSPI_IO2    M_PA10    // FLASH_SD QSPI_D2 
#define PIN_QSPI_IO3    M_PA11    // FLASH_SD QSPI_D3 
//#define M_PB12     (12+32)      // FLASH_SD QSPI_DE.    ??????

#define VARIANT_QSPI_BAUD_DEFAULT 5000000   //TODO: meaningful value for this


// SPI to Compute Module Pins
#define COMPUTEMODULE_SPI_MOSI_M    M_PA12          // BUS SPI > Compute Module MOSI
#define COMPUTEMODULE_SPI_SCK_M     M_PA13          // BUS SPI > Compute Module SKC
#define COMPUTEMODULE_SPI_CS_M      M_PA14          // BUS SPI > Compute Module CS
#define COMPUTEMODULE_SPI_MISO_M    M_PA15          // BUS SPI > Compute Module MISO


// FPGA internal SPI Bus    
#define ICE_MOSI   M_PA16   // BUS SPI > ICE 40 MOSI 
#define ICE_CLK    M_PA17   // BUS SPI > ICE 40 SCK
#define ICE_CS     M_PA18   // BUS SPI > ICE 40 CS
#define ICE_MISO   M_PA19   // BUS SPI > ICE 40 MISO
#define ICE_CDONE  M_PB08   // BUS SPI > ICE 40 CDONE
#define ICE_CRESET M_PB09   // BUS SPI > ICE 40 CRESET


// WS28 RGB LEDs
#define WS28_PIN    M_PA07      // WS28 RGB LEDs


// SLAVE PROGRAMMER (from Master SAMD)
#define RESET_SLAVE_SAMD_M   M_PA27     // RESET SLAVE SAMD 
#define SWDIO_SLAVE_SAMD_M   M_PB22     // SWDIO from SLAVE SAMD
#define SWCLK_SLAVE_SAMD_M   M_PB23     // SWCLK from SLAVE SAMD


// FOOTSWITCH PINS
#define FOOTSWITCH_1  M_PB06     // FOOTSWITCH 1
#define FOOTSWITCH_2  M_PB07     // FOOTSWITCH 2

// Wire 1 
#define BUS_I2C_1_SDA_M   M_PA04    // BUS_I2C_1_SDA  MASTER
#define BUS_I2C_1_SCL_M   M_PA05    // BUS_I2C_1_SCL  MASTER


// BUS_I2C_2 to TCA9555 on MatrixPCB and Power Distribution Chip for USB C
#define BUS_I2C_2_SDA_M   M_PB02     // BUS_I2C_2_SDA  USB_C PD + MatrixTCA955
#define BUS_I2C_2_SCL_M   M_PB03     // BUS_I2C_2_SCL  USB_C PD + MatrixTCA955
#define BUS_I2C_2_INT_M   M_PB01     // BUS_I2C_2_INT  USB_C PD + MatrixTCA955




// ONLY AVAILABLE ON SLAVE ///////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////

// ANANLOG MIDI I/O
#define MIDI_1_RX       S_PA12       // MIDI_O RX
#define MIDI_1_TX       S_PA13       // MIDI_O TX
#define MIDI_2_RX       S_PB03       // MIDI_1_RX
#define MIDI_2_TX       S_PB02       // MIDI_1_TX


// ANANLOG SYNC I/O
#define SYNC_IN_1       S_PA08      // SYNC_IN_1
#define SYNC_IN_2       S_PA09      // SYNC_IN_2
#define SYNC_OUT_1      S_PB22      // SYNC_OUT_1
#define SYNC_OUT_2      S_PB23      // SYNC_OUT_2


// TOUCHSTRIP TOUCH PINS
#define TOUCHPIN_X0     S_PA10     // PA10_TOUCH     X0
#define TOUCHPIN_X1     S_PA07     // PA07_TOUCH     X1
#define TOUCHPIN_X2     S_PA06     // PA06_TOUCH     X2
#define TOUCHPIN_Y0     S_PB08     // PB08_TOUCH     Y0
#define TOUCHPIN_Y1     S_PB07     // PB07_TOUCH     Y1
#define TOUCHPIN_Y2     S_PB06     // PB06_TOUCH     Y2
#define TOUCHPIN_Y3     S_PB05     // PB05_TOUCH     Y3
#define TOUCHPIN_Y4     S_PB04     // PB04_TOUCH     Y4
#define TOUCHPIN_Y5     S_PB01     // PB01_TOUCH     Y5
#define TOUCHPIN_Y6     S_PB00     // PB00_TOUCH     Y6
#define TOUCHPIN_Y7     S_PA21     // PA21_TOUCH     Y7
#define TOUCHPIN_Y8     S_PA20     // PA20_TOUCH     Y8
#define TOUCHPIN_Y9     S_PB15     // PB15_TOUCH     Y9
#define TOUCHPIN_Y10    S_PB14     // PB14_TOUCH     Y10
#define TOUCHPIN_Y11    S_PB13     // PB13_TOUCH     Y11
#define TOUCHPIN_Y12    S_PB12     // PB12_TOUCH     Y12
#define TOUCHPIN_Y13    S_PA11     // PA11_TOUCH     Y13


// OLED SPI BUS
#define OLED_SPI_DC     S_PA15  // OLED DISPLAY D/C
#define OLED_SPI_MOSI   S_PA16  // SPI_OLED MOSI
#define OLED_SPI_SCK    S_PA17  // SPI_OLED SCK
#define OLED_SPI_CS     S_PA18  // SPI_OLED CS
#define OLED_SPI_MISO   S_PA19  // SPI_OLED MISO
#define OLED_SPI_RESET  S_PB16  // OLED_RESET


// Wire 1
#define BUS_I2C_1_SDA_S   S_PA04    // BUS_I2C_1_SDA  Slave
#define BUS_I2C_1_SCL_S   S_PA05    // BUS_I2C_1_SCL  Slave

#define BUS_I2C_2_SDA_S   S_PA22    // I2C_2_SDA    to Touchstrip TCA9555
#define BUS_I2C_2_SCL_S   S_PA23    // I2C_2_SCL    to Touchstrip TCA9555
#define BUS_I2C_2_INT_S   S_PB09    // TCA9555 TOUCHStrip LEDs INT Pin. NOT NEEDED



// AVIALABLE ON BOTH CHIPS ///////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////

// LEDs

